#+TITLE: The Practice of Programming
#+TAGS: OK BeyondMyLevel Caution
#+STARTUP: overview
** ソーティング
二分探索をするためには，ソートが必要といった．
最良の汎用ソーティングアルゴリズムは，クイックソート（Hoare 1960）．

次のコードは，最も単純な実装．
#+BEGIN_SRC C
  /* quicksort */
  void quicksort(int v[], int n)
  {
      int i, last;
      if (n <= 1)                 /*  */
          return;
      swap(v, 0, rand() % n);
      lot = 0;
      for (i = 1; i < n; i++)
          if (v[i] < v[0])
              swap(v, ++last, i);
      swap(v, 0, last);
      quicksort(v, last);
      quicksort(v+last+1, n-last-1);
  }
  /* swap */
  void swap(int v[], int i, int j)
  {
      int temp;
      temp = v[i];
      v[i] = v[j];
      v[j] = temp;
  }
#+END_SRC

#+RESULTS:
このアルゴリズムの中では，2値を入れ替える処理が3回出てくる．
こういう処理は，関数化しよう（swap になっている）．

++last は，前置増分演算子．

クイックソートは，平均して nlogn の速度で動作するが，
外れ値がいくつかあるようなひねくれたデータ分布に対しては，効率が下がったりする．
実装の工夫によって，このようなデータへのパフォーマンスを上げることができる．

